ut-robotics/picr22-team-snax/firmware/snax/snax_firmware.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32G4
ProjectManager.MainLocation=Core/Src
Dma.TIM8_CH1.0.Direction=DMA_MEMORY_TO_PERIPH
SH.S_TIM4_CH2.ConfNb=1
USB_DEVICE.CLASS_NAME_FS=CDC
RCC.USART1Freq_Value=160000000
RCC.SAI1Freq_Value=160000000
RCC.CortexFreq_Value=160000000
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32G441KBTx
NVIC.TIM6_DAC_IRQn=true\:0\:0\:false\:false\:true\:true\:true
TIM1.IPParameters=EncoderMode
PA0.GPIO_Label=M1_DIR
TIM3.EncoderMode=TIM_ENCODERMODE_TI12
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-MX_DMA_Init-DMA-false-HAL-true,3-SystemClock_Config-RCC-false-HAL-false,4-MX_USB_Device_Init-USB_DEVICE-false-HAL-false,5-MX_TIM1_Init-TIM1-false-HAL-true,6-MX_TIM3_Init-TIM3-false-HAL-true,7-MX_TIM4_Init-TIM4-false-HAL-true,8-MX_TIM2_Init-TIM2-false-HAL-true,9-MX_TIM16_Init-TIM16-false-HAL-true,10-MX_TIM6_Init-TIM6-false-HAL-true,11-MX_TIM8_Init-TIM8-false-HAL-true
TIM1.EncoderMode=TIM_ENCODERMODE_TI12
PA11.Mode=Device
PA3.GPIOParameters=GPIO_Label
RCC.USART2Freq_Value=160000000
Dma.TIM8_CH1.0.SyncRequestNumber=1
SH.S_TIM1_CH1.ConfNb=1
TIM2.Channel-PWM\ Generation2\ CH2=TIM_CHANNEL_2
PA2.GPIOParameters=GPIO_Label
PinOutPanel.RotationAngle=0
RCC.MCO1PinFreq_Value=16000000
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
ProjectManager.StackSize=0x400
RCC.I2C3Freq_Value=160000000
RCC.LPTIM1Freq_Value=160000000
Mcu.IP4=TIM1
RCC.FCLKCortexFreq_Value=160000000
Mcu.IP5=TIM2
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.IP2=RCC
Mcu.IP3=SYS
Mcu.IP0=DMA
Mcu.IP1=NVIC
PA12.Signal=USB_DP
Mcu.UserConstants=
SH.S_TIM16_CH1.ConfNb=1
SH.S_TIM3_CH2.ConfNb=1
Mcu.ThirdPartyNb=0
RCC.HCLKFreq_Value=160000000
TIM8.Channel-PWM\ Generation1\ CH1=TIM_CHANNEL_1
Mcu.IPNb=13
TIM2.IPParameters=Channel-PWM Generation2 CH2,PeriodNoDither,Channel-PWM Generation4 CH4,Channel-PWM Generation1 CH1
ProjectManager.PreviousToolchain=
RCC.APB2TimFreq_Value=160000000
PB6.Signal=S_TIM4_CH1
Mcu.Pin6=PA8
Mcu.Pin7=PA9
PB8-BOOT0.GPIOParameters=GPIO_Label
Dma.TIM8_CH1.0.MemDataAlignment=DMA_MDATAALIGN_HALFWORD
Mcu.Pin8=PA11
Mcu.Pin9=PA12
RCC.AHBFreq_Value=160000000
Mcu.Pin0=PA0
Mcu.Pin1=PA1
TIM8.IPParameters=Channel-PWM Generation1 CH1,OCPolarity_1,OCIdleState_1,PeriodNoDither
Mcu.Pin2=PA2
Mcu.Pin3=PA3
RCC.USART3Freq_Value=160000000
Mcu.Pin4=PA4
Mcu.Pin5=PA5
ProjectManager.ProjectBuild=false
RCC.HSE_VALUE=8000000
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA0.Locked=true
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA4.Locked=true
Mcu.IP10=TIM16
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
RCC.ADC12Freq_Value=160000000
Mcu.IP12=USB_DEVICE
Mcu.IP11=USB
ProjectManager.FirmwarePackage=STM32Cube FW_G4 V1.4.0
MxDb.Version=DB.6.0.21
TIM2.PeriodNoDither=65535
PA1.GPIOParameters=GPIO_Label
ProjectManager.BackupPrevious=false
RCC.VCOInputFreq_Value=16000000
PA14.Mode=Serial_Wire
File.Version=6
VP_SYS_VS_DBSignals.Mode=DisableDeadBatterySignals
SH.S_TIM4_CH2.0=TIM4_CH2,Encoder_Interface
SH.S_TIM2_CH1.ConfNb=1
PB7.Signal=S_TIM4_CH2
PA8.Signal=S_TIM1_CH1
RCC.PLLRCLKFreq_Value=160000000
TIM2.Channel-PWM\ Generation1\ CH1=TIM_CHANNEL_1
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
SH.S_TIM3_CH1.0=TIM3_CH1,Encoder_Interface
Dma.RequestsNb=1
ProjectManager.HalAssertFull=false
SH.S_TIM8_CH1.ConfNb=1
RCC.CRSFreq_Value=48000000
ProjectManager.ProjectName=BTS_firmware
PA0.Signal=GPIO_Output
Mcu.Package=LQFP32
PA5.Locked=true
TIM6.PeriodNoDither=63999
ProjectManager.ToolChainLocation=
PA2.GPIO_Label=M2_DIR
RCC.LSI_VALUE=32000
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
RCC.LSCOPinFreq_Value=32000
PA15.Signal=S_TIM8_CH1
VP_USB_DEVICE_VS_USB_DEVICE_CDC_FS.Signal=USB_DEVICE_VS_USB_DEVICE_CDC_FS
PA5.GPIOParameters=GPIO_Label
PB8-BOOT0.GPIO_Label=THROWER
NVIC.USB_LP_IRQn=true\:0\:0\:false\:false\:true\:false\:true
RCC.PLLPoutputFreq_Value=160000000
SH.S_TIM4_CH1.0=TIM4_CH1,Encoder_Interface
RCC.APB1TimFreq_Value=160000000
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
RCC.LPUART1Freq_Value=160000000
Dma.TIM8_CH1.0.SyncEnable=DISABLE
RCC.CK48CLockSelection=RCC_USBCLKSOURCE_HSI48
TIM16.Prescaler=79
SH.S_TIM2_CH4.ConfNb=1
Dma.Request0=TIM8_CH1
PA4.GPIO_Label=M3_DIR
Dma.TIM8_CH1.0.Polarity=HAL_DMAMUX_REQ_GEN_RISING
ProjectManager.CustomerFirmwarePackage=
RCC.HSI48_VALUE=48000000
PB4.Signal=S_TIM3_CH1
PA3.Signal=S_TIM2_CH4
PA2.Locked=true
SH.S_TIM4_CH1.ConfNb=1
RCC.I2SFreq_Value=160000000
RCC.PLLQoutputFreq_Value=160000000
ProjectManager.ProjectFileName=BTS_firmware.ioc
TIM2.Channel-PWM\ Generation4\ CH4=TIM_CHANNEL_4
SH.S_TIM2_CH1.0=TIM2_CH1,PWM Generation1 CH1
Mcu.PinsNb=23
ProjectManager.NoMain=false
USB_DEVICE.VirtualModeFS=Cdc_FS
TIM6.Prescaler=24
VP_TIM6_VS_ClockSourceINT.Mode=Enable_Timer
RCC.EXTERNAL_CLOCK_VALUE=12288000
ProjectManager.DefaultFWLocation=true
SH.S_TIM16_CH1.0=TIM16_CH1,PWM Generation1 CH1
VP_TIM16_VS_ClockSourceINT.Mode=Enable_Timer
ProjectManager.DeletePrevious=true
USB_DEVICE.IPParameters=VirtualMode,VirtualModeFS,CLASS_NAME_FS
TIM16.Channel=TIM_CHANNEL_1
Dma.TIM8_CH1.0.PeriphDataAlignment=DMA_PDATAALIGN_HALFWORD
RCC.FamilyName=M
PB8-BOOT0.Locked=true
VP_TIM6_VS_ClockSourceINT.Signal=TIM6_VS_ClockSourceINT
PA13.Signal=SYS_JTMS-SWDIO
Dma.TIM8_CH1.0.EventEnable=DISABLE
Dma.TIM8_CH1.0.Priority=DMA_PRIORITY_LOW
SH.S_TIM2_CH2.0=TIM2_CH2,PWM Generation2 CH2
TIM6.IPParameters=PeriodNoDither,Prescaler
SH.S_TIM1_CH1.0=TIM1_CH1,Encoder_Interface
ProjectManager.TargetToolchain=STM32CubeIDE
VP_USB_DEVICE_VS_USB_DEVICE_CDC_FS.Mode=CDC_FS
PA9.Signal=S_TIM1_CH2
SH.S_TIM2_CH2.ConfNb=1
Dma.TIM8_CH1.0.SyncSignalID=NONE
PB5.Locked=true
ProjectManager.RegisterCallBack=
RCC.USBFreq_Value=48000000
RCC.LSE_VALUE=32768
PA1.Signal=S_TIM2_CH2
SH.S_TIM1_CH2.ConfNb=1
PA5.Signal=S_TIM2_CH1
SH.S_TIM3_CH2.0=TIM3_CH2,Encoder_Interface
SH.S_TIM8_CH1.0=TIM8_CH1,PWM Generation1 CH1
PB8-BOOT0.Signal=S_TIM16_CH1
board=custom
Dma.TIM8_CH1.0.SignalID=NONE
RCC.VCOOutputFreq_Value=320000000
Dma.TIM8_CH1.0.MemInc=DMA_MINC_ENABLE
ProjectManager.LastFirmware=true
TIM16.PeriodNoDither=39999
RCC.APB2Freq_Value=160000000
RCC.UART4Freq_Value=160000000
MxCube.Version=6.2.1
SH.S_TIM1_CH2.0=TIM1_CH2,Encoder_Interface
RCC.I2C1Freq_Value=160000000
VP_SYS_VS_DBSignals.Signal=SYS_VS_DBSignals
Dma.TIM8_CH1.0.Mode=DMA_NORMAL
RCC.FDCANFreq_Value=160000000
RCC.RNGFreq_Value=48000000
PA1.GPIO_Label=M1_PWM
VP_SYS_VS_Systick.Mode=SysTick
TIM3.IPParameters=EncoderMode
VP_TIM16_VS_ClockSourceINT.Signal=TIM16_VS_ClockSourceINT
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA4.GPIOParameters=GPIO_Label
PA13.Mode=Serial_Wire
ProjectManager.FreePins=false
Dma.TIM8_CH1.0.Instance=DMA1_Channel1
RCC.IPParameters=ADC12Freq_Value,AHBFreq_Value,APB1Freq_Value,APB1TimFreq_Value,APB2Freq_Value,APB2TimFreq_Value,CK48CLockSelection,CRSFreq_Value,CortexFreq_Value,EXTERNAL_CLOCK_VALUE,FCLKCortexFreq_Value,FDCANFreq_Value,FamilyName,HCLKFreq_Value,HSE_VALUE,HSI48_VALUE,HSI_VALUE,I2C1Freq_Value,I2C2Freq_Value,I2C3Freq_Value,I2SFreq_Value,LPTIM1Freq_Value,LPUART1Freq_Value,LSCOPinFreq_Value,LSE_VALUE,LSI_VALUE,MCO1PinFreq_Value,PLLN,PLLPoutputFreq_Value,PLLQoutputFreq_Value,PLLRCLKFreq_Value,PWRFreq_Value,RNGFreq_Value,SAI1Freq_Value,SYSCLKFreq_VALUE,SYSCLKSource,UART4Freq_Value,USART1Freq_Value,USART2Freq_Value,USART3Freq_Value,USBFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value
ProjectManager.AskForMigrate=true
Mcu.Name=STM32G441KBTx
Dma.TIM8_CH1.0.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber
PA2.Signal=GPIO_Output
ProjectManager.UnderRoot=true
Mcu.IP8=TIM6
Mcu.IP9=TIM8
TIM8.OCPolarity_1=TIM_OCPOLARITY_LOW
Mcu.IP6=TIM3
Mcu.IP7=TIM4
ProjectManager.CoupleFile=false
PB4.Locked=true
PA4.Signal=GPIO_Output
Dma.TIM8_CH1.0.RequestNumber=1
RCC.SYSCLKFreq_VALUE=160000000
PB5.Signal=S_TIM3_CH2
Mcu.Pin22=VP_USB_DEVICE_VS_USB_DEVICE_CDC_FS
Mcu.Pin20=VP_TIM6_VS_ClockSourceINT
PA3.Locked=true
Mcu.Pin21=VP_TIM16_VS_ClockSourceINT
PA12.Mode=Device
PA5.GPIO_Label=M3_PWM
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.CompilerOptimize=6
Dma.TIM8_CH1.0.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
PA11.Signal=USB_DM
PA14.Signal=SYS_JTCK-SWCLK
ProjectManager.HeapSize=0x200
PA0.GPIOParameters=GPIO_Label
Mcu.Pin15=PB6
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.Pin16=PB7
Mcu.Pin13=PB4
SH.S_TIM2_CH4.0=TIM2_CH4,PWM Generation4 CH4
Mcu.Pin14=PB5
Mcu.Pin19=VP_SYS_VS_DBSignals
TIM8.PeriodNoDither=15999
SH.S_TIM3_CH1.ConfNb=1
ProjectManager.ComputerToolchain=false
Mcu.Pin17=PB8-BOOT0
RCC.HSI_VALUE=16000000
Mcu.Pin18=VP_SYS_VS_Systick
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
TIM8.OCIdleState_1=TIM_OCIDLESTATE_SET
Mcu.Pin11=PA14
Mcu.Pin12=PA15
RCC.PLLN=20
Mcu.Pin10=PA13
Dma.TIM8_CH1.0.PeriphInc=DMA_PINC_DISABLE
RCC.PWRFreq_Value=160000000
TIM16.IPParameters=Channel,Prescaler,PeriodNoDither
NVIC.DMA1_Channel1_IRQn=true\:0\:0\:false\:false\:true\:false\:true
RCC.I2C2Freq_Value=160000000
RCC.APB1Freq_Value=160000000
USB_DEVICE.VirtualMode=Cdc
ProjectManager.DeviceId=STM32G441KBTx
ProjectManager.LibraryCopy=1
PA3.GPIO_Label=M2_PWM
isbadioc=false
